app/views/admins/home.html.erb


<p>Want to change info? <%= link_to "Click Here!", admin_path(Admin.first) %></p>
---
SELECT  "admins".* FROM "admins"  ORDER BY "admins"."id" ASC LIMIT 1