app/views/admins/see_info.html.erb

    <% i=1 %>
    <% Student.all.each do |student| %>
---
SELECT "students".* FROM "students"