app/views/admins/see_info.html.erb

SELECT "advisor_users".* FROM "advisor_users"
---
  <tbody>
    <% AdvisorUser.all.each do |advisor_user| %>

SELECT "student_users".* FROM "student_users"
---
    <% i=1 %>
    <% StudentUser.all.each do |student| %>