app/views/payment/marketplace.html.erb

SELECT  "admins".* FROM "admins"  ORDER BY "admins"."id" ASC LIMIT 1
---
<div>
	<iframe frameborder="0" height="500" scrolling="no" src=<%= Admin.first.mkt_place_url %> width="706">