app/controllers/admins_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_advisor_user
      #@admin = Admin.first
      @admin = Admin.find_by_id(params[:id])