app/controllers/admins_controller.rb

INSERT INTO "admins" ("email", "password_digest", "usertype", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save

UPDATE "admins" SET "right_sig_url" = $1, "updated_at" = $2 WHERE "admins"."id" = $3  [["right_sig_url", ""], ["updated_at", "2015-05-04 08:50:41.617049"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @admin.update_attribute(:name , params[:admin][:name]) | @admin.update_attribute(:right_sig_url , params[:admin][:right_sig_url]) |

SELECT  "admins".* FROM "admins"  ORDER BY "admins"."id" ASC LIMIT 1
---
    def set_advisor_user
      @admin = Admin.first