app/controllers/advisor_controller.rb

UPDATE "advisor_users" SET "team_name" = $1, "updated_at" = $2 WHERE "advisor_users"."id" = $3  [["team_name", "The Gents"], ["updated_at", "2015-05-04 05:01:00.804650"], ["id", 2]]
---
  def create_team
    new_team_code = genTeamCode(current_user.id)
    team_params = {
        :team_name => params[:teamname],
        :team_code => new_team_code,
        :advisor_user_id => current_user.id,
    }
    team = Team.new(team_params)
    team.save

    current_user.update_attribute( :team_name, params[:teamname] )