app/controllers/advisor_users_controller.rb

SELECT "advisor_users".* FROM "advisor_users"
---
  def index
    @advisor_users = AdvisorUser.all

INSERT INTO "advisor_users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "jakewier"], ["password", "hellohello"], ["created_at", "2015-04-07 21:22:02.722042"], ["updated_at", "2015-04-07 21:22:02.722042"]]
---
  def create
    @advisor_user = AdvisorUser.new(advisor_user_params)

    # generate their paycode if they are paying for students
    @advisor_user.pay_code = genPayCode(@advisor_user.id)

    @advisor_user.usertype="advisor"

    respond_to do |format|
      if @advisor_user.save

UPDATE "advisor_users" SET "username" = $1, "updated_at" = $2 WHERE "advisor_users"."id" = $3  [["username", "zach@yahoo.com"], ["updated_at", "2015-04-25 19:56:13.977784"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @advisor_user.update(advisor_user_params)

DELETE FROM "advisor_users" WHERE "advisor_users"."id" = $1  [["id", 1]]
---
  def destroy
    @advisor_user.destroy

SELECT  "advisor_users".* FROM "advisor_users" WHERE "advisor_users"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_advisor_user
      @advisor_user = AdvisorUser.find(params[:id])