app/controllers/join_team_controller.rb

SELECT  "advisor_users".* FROM "advisor_users" WHERE "advisor_users"."team_code" = $1 LIMIT 1  [["team_code", "fasfadsfa"]]
---
  def parse_comments
    team_code = params['team_code']

	result = AdvisorUser.where(team_code: team_code).take