app/controllers/payment_controller.rb

  def checkpay
    pay_code = params['pay_code']

	result = AdvisorUser.where(pay_code: pay_code).take
---
SELECT  "advisor_users".* FROM "advisor_users" WHERE "advisor_users"."pay_code" = $1 LIMIT 1  [["pay_code", "Y833271"]]