app/controllers/sessions_controller.rb

  def create
    if params[:session][:email] && params[:session][:email].downcase=="admin@admin.com"
      user = Admin.find_by(email: params[:session][:email].downcase)
        if user.authenticate(params[:session][:password])
          flash.now[:flash] = 'Successfully logged in'
          admin_log_in user
          render 'admins/home'
        else
          #create an error message
          flash.now[:danger] = 'Invalid email/password combination'
          render 'new'
        end
    else
      user = AdvisorUser.find_by(username: params[:session][:email].downcase)
---
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT 1  [["email", "thekevster@gmail.com"]]
SELECT  "advisor_users".* FROM "advisor_users" WHERE "advisor_users"."username" = $1 LIMIT 1  [["username", "zach@yahoo.com"]]