app/controllers/student_users_controller.rb

  def index
    @student_users = StudentUser.all
---
SELECT "student_users".* FROM "student_users"

  def create
    @student_user = StudentUser.new(student_user_params)

    respond_to do |format|
      if @student_user.save
---
INSERT INTO "student_users" ("first_name", "last_name", "school_level", "school_name") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Jake"], ["last_name", "Wier"], ["school_level", "Elementary"], ["school_name", "Hwllo Elementary"]]

    def set_student_user
      @student_user = StudentUser.find(params[:id])
---
SELECT  "student_users".* FROM "student_users" WHERE "student_users"."id" = $1 LIMIT 1  [["id", 4]]