app/views/advisor/index.html.erb

            <tbody>
                <% Team.all.each do |team| %>
---
SELECT "teams".* FROM "teams"